FIO-tests-09-53-07-01-2021-AAAAA/Configs/Test-results/fio-results
read-4k-0: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
read-4k-1: (g=1): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.16
Starting 2 processes
{
  "fio version" : "fio-3.16",
  "timestamp" : 1610013298,
  "timestamp_ms" : 1610013298954,
  "time" : "Thu Jan  7 09:54:58 2021",
  "global options" : {
    "ioengine" : "libaio",
    "size" : "1G",
    "direct" : "1",
    "runtime" : "30",
    "time_based" : "1",
    "filename" : "/data/fio.test.file"
  },
  "jobs" : [
    {
      "jobname" : "read-4k-0",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 61,
      "job options" : {
        "rw" : "read",
        "bs" : "4k",
        "iodepth" : "1",
        "numjobs" : "1"
      },
      "read" : {
        "io_bytes" : 700444672,
        "io_kbytes" : 684028,
        "bw_bytes" : 23347377,
        "bw" : 22800,
        "iops" : 5700.043332,
        "runtime" : 30001,
        "total_ios" : 171007,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 37753,
          "max" : 12436143,
          "mean" : 115059.844240,
          "stddev" : 234387.339025
        },
        "clat_ns" : {
          "min" : 1991,
          "max" : 11971224,
          "mean" : 58284.142444,
          "stddev" : 178439.174089,
          "percentile" : {
            "1.000000" : 2096,
            "5.000000" : 2128,
            "10.000000" : 2160,
            "20.000000" : 2192,
            "30.000000" : 2224,
            "40.000000" : 2288,
            "50.000000" : 2320,
            "60.000000" : 2416,
            "70.000000" : 119296,
            "80.000000" : 130560,
            "90.000000" : 177152,
            "95.000000" : 183296,
            "99.000000" : 224256,
            "99.500000" : 254976,
            "99.900000" : 2310144,
            "99.950000" : 3031040,
            "99.990000" : 7307264
          }
        },
        "lat_ns" : {
          "min" : 120767,
          "max" : 12442622,
          "mean" : 173843.953493,
          "stddev" : 280362.601513
        },
        "bw_min" : 9497,
        "bw_max" : 21401,
        "bw_agg" : 80.172019,
        "bw_mean" : 18279.220339,
        "bw_dev" : 3273.124507,
        "bw_samples" : 59,
        "iops_min" : 2374,
        "iops_max" : 5350,
        "iops_mean" : 4569.440678,
        "iops_stddev" : 818.243562,
        "iops_samples" : 59
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "total_ios" : 0
      },
      "job_runtime" : 30000,
      "usr_cpu" : 3.310000,
      "sys_cpu" : 68.213333,
      "ctx" : 58453,
      "majf" : 0,
      "minf" : 13,
      "iodepth_level" : {
        "1" : 100.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.010000,
        "4" : 66.622419,
        "10" : 0.191220,
        "20" : 0.097072,
        "50" : 0.042688,
        "100" : 0.047366,
        "250" : 32.461829,
        "500" : 0.312268,
        "750" : 0.019297,
        "1000" : 0.012280
      },
      "latency_ms" : {
        "2" : 0.025730,
        "4" : 0.129234,
        "10" : 0.029823,
        "20" : 0.010000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 1,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    },
    {
      "jobname" : "read-4k-1",
      "groupid" : 1,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 61,
      "job options" : {
        "rw" : "read",
        "bs" : "4k",
        "iodepth" : "8",
        "numjobs" : "1"
      },
      "read" : {
        "io_bytes" : 1973944320,
        "io_kbytes" : 1927680,
        "bw_bytes" : 65795950,
        "bw" : 64253,
        "iops" : 16063.464551,
        "runtime" : 30001,
        "total_ios" : 481920,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 4264,
          "max" : 10871004,
          "mean" : 45840.220111,
          "stddev" : 101694.365933
        },
        "clat_ns" : {
          "min" : 88406,
          "max" : 12532683,
          "mean" : 450798.000046,
          "stddev" : 352417.136576,
          "percentile" : {
            "1.000000" : 89600,
            "5.000000" : 90624,
            "10.000000" : 193536,
            "20.000000" : 207872,
            "30.000000" : 313344,
            "40.000000" : 337920,
            "50.000000" : 448512,
            "60.000000" : 536576,
            "70.000000" : 577536,
            "80.000000" : 585728,
            "90.000000" : 667648,
            "95.000000" : 839680,
            "99.000000" : 1122304,
            "99.500000" : 1236992,
            "99.900000" : 4620288,
            "99.950000" : 7766016,
            "99.990000" : 11206656
          }
        },
        "lat_ns" : {
          "min" : 148076,
          "max" : 12537318,
          "mean" : 496989.295462,
          "stddev" : 351259.127755
        },
        "bw_min" : 48215,
        "bw_max" : 68776,
        "bw_agg" : 99.904482,
        "bw_mean" : 64191.627119,
        "bw_dev" : 3823.465655,
        "bw_samples" : 59,
        "iops_min" : 12053,
        "iops_max" : 17194,
        "iops_mean" : 16047.847458,
        "iops_stddev" : 955.915571,
        "iops_samples" : 59
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "total_ios" : 0
      },
      "job_runtime" : 30000,
      "usr_cpu" : 5.776667,
      "sys_cpu" : 74.103333,
      "ctx" : 46856,
      "majf" : 0,
      "minf" : 19,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 99.998547,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.999792,
        "8" : 0.100000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 8.245559,
        "250" : 17.253486,
        "500" : 33.433557,
        "750" : 34.074535,
        "1000" : 4.545568
      },
      "latency_ms" : {
        "2" : 2.161562,
        "4" : 0.159363,
        "10" : 0.099602,
        "20" : 0.026768,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 8,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "vda",
      "read_ios" : 651124,
      "write_ios" : 1,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 102008,
      "write_ticks" : 1,
      "in_queue" : 780,
      "util" : 99.496368
    }
  ]
}

read-4k-0: (groupid=0, jobs=1): err= 0: pid=296: Thu Jan  7 09:54:58 2021
  read: IOPS=5700, BW=22.3MiB/s (23.3MB/s)(668MiB/30001msec)
    slat (usec): min=37, max=12436, avg=115.06, stdev=234.39
    clat (nsec): min=1991, max=11971k, avg=58284.14, stdev=178439.17
     lat (usec): min=120, max=12442, avg=173.84, stdev=280.36
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    3],
     | 70.00th=[  120], 80.00th=[  131], 90.00th=[  178], 95.00th=[  184],
     | 99.00th=[  225], 99.50th=[  255], 99.90th=[ 2311], 99.95th=[ 3032],
     | 99.99th=[ 7308]
   bw (  KiB/s): min= 9497, max=21401, per=80.17%, avg=18279.22, stdev=3273.12, samples=59
   iops        : min= 2374, max= 5350, avg=4569.44, stdev=818.24, samples=59
  lat (usec)   : 2=0.01%, 4=66.62%, 10=0.19%, 20=0.10%, 50=0.04%
  lat (usec)   : 100=0.05%, 250=32.46%, 500=0.31%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.03%, 4=0.13%, 10=0.03%, 20=0.01%
  cpu          : usr=3.31%, sys=68.21%, ctx=58453, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=171007,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
read-4k-1: (groupid=1, jobs=1): err= 0: pid=298: Thu Jan  7 09:54:58 2021
  read: IOPS=16.1k, BW=62.7MiB/s (65.8MB/s)(1883MiB/30001msec)
    slat (usec): min=4, max=10871, avg=45.84, stdev=101.69
    clat (usec): min=88, max=12532, avg=450.80, stdev=352.42
     lat (usec): min=148, max=12537, avg=496.99, stdev=351.26
    clat percentiles (usec):
     |  1.00th=[   90],  5.00th=[   91], 10.00th=[  194], 20.00th=[  208],
     | 30.00th=[  314], 40.00th=[  338], 50.00th=[  449], 60.00th=[  537],
     | 70.00th=[  578], 80.00th=[  586], 90.00th=[  668], 95.00th=[  840],
     | 99.00th=[ 1123], 99.50th=[ 1237], 99.90th=[ 4621], 99.95th=[ 7767],
     | 99.99th=[11207]
   bw (  KiB/s): min=48215, max=68776, per=99.90%, avg=64191.63, stdev=3823.47, samples=59
   iops        : min=12053, max=17194, avg=16047.85, stdev=955.92, samples=59
  lat (usec)   : 100=8.25%, 250=17.25%, 500=33.43%, 750=34.07%, 1000=4.55%
  lat (msec)   : 2=2.16%, 4=0.16%, 10=0.10%, 20=0.03%
  cpu          : usr=5.78%, sys=74.10%, ctx=46856, majf=0, minf=19
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=481920,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=22.3MiB/s (23.3MB/s), 22.3MiB/s-22.3MiB/s (23.3MB/s-23.3MB/s), io=668MiB (700MB), run=30001-30001msec

Run status group 1 (all jobs):
   READ: bw=62.7MiB/s (65.8MB/s), 62.7MiB/s-62.7MiB/s (65.8MB/s-65.8MB/s), io=1883MiB (1974MB), run=30001-30001msec

Disk stats (read/write):
  vda: ios=651124/1, merge=0/0, ticks=102008/1, in_queue=780, util=99.50%